; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 - counter
	)
  (:init
		(= (value c0) 59)
	(= (value c1) 2)
	(= (value c2) 23)
	(= (value c3) 88)
	(= (value c4) 13)
	(= (value c5) 83)
	(= (value c6) 60)
	(= (value c7) 93)
	(= (value c8) 48)
	(= (value c9) 90)
	(= (value c10) 27)
	(= (value c11) 77)
	(= (value c12) 31)
	(= (value c13) 35)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
		)
	)
)

; plan
1. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 7 of 13
2. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 7 of 13
3. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 7 of 13
4. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 7 of 13
5. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 7 of 13
6. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 7 of 13
7. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 7 of 13
8. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 7 of 13
9. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 7 of 13
10. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 7 of 13
11. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 7 of 13
12. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 7 of 13
13. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 7 of 13
14. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 7 of 13
15. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 7 of 13
16. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 7 of 13
17. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 7 of 13
18. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 7 of 13
19. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 7 of 13
20. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 7 of 13
21. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 7 of 13
22. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 7 of 13
23. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 7 of 13
24. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 7 of 13
25. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 7 of 13
26. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 7 of 13
27. (increment c10)
   changed: (value c10) from 27 to 33
   goals met: 7 of 13
28. (increment c10)
   changed: (value c10) from 33 to 39
   goals met: 7 of 13
29. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 7 of 13
30. (increment c10)
   changed: (value c10) from 39 to 46
   goals met: 7 of 13
31. (increment c10)
   changed: (value c10) from 46 to 53
   goals met: 7 of 13
32. (increment c10)
   changed: (value c10) from 53 to 60
   goals met: 7 of 13
33. (increment c10)
   changed: (value c10) from 60 to 67
   goals met: 7 of 13
34. (increment c10)
   changed: (value c10) from 67 to 74
   goals met: 7 of 13
35. (increment c10)
   changed: (value c10) from 74 to 81
   goals met: 6 of 13
36. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 6 of 13
37. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 6 of 13
38. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 6 of 13
39. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 6 of 13
40. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 6 of 13
41. (increment c6)
   changed: (value c6) from 60 to 66
   goals met: 6 of 13
42. (increment c6)
   changed: (value c6) from 66 to 72
   goals met: 6 of 13
43. (increment c6)
   changed: (value c6) from 72 to 78
   goals met: 6 of 13
44. (increment c6)
   changed: (value c6) from 78 to 84
   goals met: 7 of 13
45. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 7 of 13
46. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 7 of 13
47. (increment c1)
   changed: (value c1) from 2 to 11
   goals met: 7 of 13
48. (increment c1)
   changed: (value c1) from 11 to 20
   goals met: 7 of 13
49. (increment c1)
   changed: (value c1) from 20 to 29
   goals met: 6 of 13
50. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 6 of 13
51. (increment c1)
   changed: (value c1) from 29 to 39
   goals met: 6 of 13
52. (decrement c10)
   changed: (value c10) from 81 to 74
   goals met: 7 of 13
53. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 7 of 13
54. (decrement c9)
   changed: (value c9) from 90 to 85
   goals met: 7 of 13
55. (increment c10)
   changed: (value c10) from 74 to 81
   goals met: 6 of 13
56. (decrement c9)
   changed: (value c9) from 85 to 80
   goals met: 7 of 13
57. (decrement c10)
   changed: (value c10) from 81 to 74
   goals met: 7 of 13
58. (decrement c9)
   changed: (value c9) from 80 to 75
   goals met: 7 of 13
59. (decrement c9)
   changed: (value c9) from 75 to 70
   goals met: 8 of 13
60. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 8 of 13
61. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 8 of 13
62. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 8 of 13
63. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 8 of 13
64. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 8 of 13
65. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 8 of 13
66. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 8 of 13
67. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 8 of 13
68. (increment c12)
   changed: (value c12) from 31 to 39
   goals met: 7 of 13
69. (increment c12)
   changed: (value c12) from 39 to 47
   goals met: 7 of 13
70. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 7 of 13
71. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 7 of 13
72. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 7 of 13
73. (decrement c12)
   changed: (value c12) from 47 to 39
   goals met: 7 of 13
74. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 7 of 13
75. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 7 of 13
76. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 7 of 13
77. (increment c12)
   changed: (value c12) from 39 to 49
   goals met: 7 of 13
78. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 7 of 13
79. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 7 of 13
80. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 7 of 13
81. (increment c13)
   changed: (value c13) from 35 to 38
   goals met: 7 of 13
82. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 13
83. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 7 of 13
84. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 7 of 13
85. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 7 of 13
86. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 13
87. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 7 of 13
88. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 7 of 13
89. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 7 of 13
90. (increment c8)
   changed: (value c8) from 48 to 56
   goals met: 7 of 13
91. (increment c8)
   changed: (value c8) from 56 to 64
   goals met: 7 of 13
92. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 13
93. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 13
94. (increment c8)
   changed: (value c8) from 64 to 72
   goals met: 6 of 13
95. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 6 of 13
96. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 6 of 13
97. (increment c8)
   changed: (value c8) from 72 to 82
   goals met: 6 of 13
98. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 6 of 13
99. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 6 of 13
100. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 6 of 13
101. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 6 of 13
102. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 6 of 13
103. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 6 of 13
104. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 6 of 13
105. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 6 of 13
106. (increment c4)
   changed: (value c4) from 13 to 22
   goals met: 6 of 13
107. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 6 of 13
108. (increment c4)
   changed: (value c4) from 22 to 32
   goals met: 6 of 13
109. (increment c4)
   changed: (value c4) from 32 to 42
   goals met: 6 of 13
110. (increment c4)
   changed: (value c4) from 42 to 52
   goals met: 6 of 13
111. (increment c4)
   changed: (value c4) from 52 to 62
   goals met: 6 of 13
112. (increment c4)
   changed: (value c4) from 62 to 72
   goals met: 6 of 13
113. (increment c4)
   changed: (value c4) from 72 to 82
   goals met: 6 of 13
114. (decrement c3)
   changed: (value c3) from 88 to 83
   goals met: 6 of 13
115. (decrement c3)
   changed: (value c3) from 83 to 78
   goals met: 7 of 13
116. (increment c13)
   changed: (value c13) from 38 to 41
   goals met: 7 of 13
117. (increment c13)
   changed: (value c13) from 41 to 44
   goals met: 7 of 13
118. (increment c13)
   changed: (value c13) from 44 to 47
   goals met: 7 of 13
119. (increment c13)
   changed: (value c13) from 47 to 50
   goals met: 8 of 13
120. (decrement c11)
   changed: (value c11) from 77 to 73
   goals met: 7 of 13
121. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 7 of 13
122. (decrement c11)
   changed: (value c11) from 73 to 68
   goals met: 7 of 13
123. (decrement c11)
   changed: (value c11) from 68 to 63
   goals met: 7 of 13
124. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 7 of 13
125. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 7 of 13
126. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 7 of 13
127. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 7 of 13
128. (increment c2)
   changed: (value c2) from 23 to 27
   goals met: 7 of 13
129. (increment c2)
   changed: (value c2) from 27 to 31
   goals met: 7 of 13
130. (increment c2)
   changed: (value c2) from 31 to 35
   goals met: 7 of 13
131. (increment c2)
   changed: (value c2) from 35 to 39
   goals met: 7 of 13
132. (increment c2)
   changed: (value c2) from 39 to 43
   goals met: 8 of 13
133. (increment c1)
   changed: (value c1) from 39 to 49
   goals met: 7 of 13
134. (increment c2)
   changed: (value c2) from 43 to 47
   goals met: 7 of 13
135. (increment c1)
   changed: (value c1) from 49 to 59
   goals met: 7 of 13
136. (increment c2)
   changed: (value c2) from 47 to 51
   goals met: 7 of 13
137. (decrement c1)
   changed: (value c1) from 59 to 49
   goals met: 8 of 13
138. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 8 of 13
139. (increment c1)
   changed: (value c1) from 49 to 59
   goals met: 7 of 13
140. (increment c2)
   changed: (value c2) from 51 to 55
   goals met: 7 of 13
141. (increment c2)
   changed: (value c2) from 55 to 59
   goals met: 7 of 13
142. (increment c2)
   changed: (value c2) from 59 to 63
   goals met: 8 of 13
143. (decrement c0)
   changed: (value c0) from 59 to 58
   goals met: 9 of 13
144. (increment c12)
   changed: (value c12) from 49 to 59
   goals met: 8 of 13
145. (increment c12)
   changed: (value c12) from 59 to 69
   goals met: 9 of 13
146. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 9 of 13
147. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 9 of 13
148. (increment c13)
   changed: (value c13) from 50 to 55
   goals met: 9 of 13
149. (increment c13)
   changed: (value c13) from 55 to 60
   goals met: 9 of 13
150. (increment c13)
   changed: (value c13) from 60 to 65
   goals met: 9 of 13
151. (increment c13)
   changed: (value c13) from 65 to 70
   goals met: 10 of 13
152. (increment c11)
   changed: (value c11) from 63 to 68
   goals met: 10 of 13
153. (increment c8)
   changed: (value c8) from 82 to 92
   goals met: 10 of 13
154. (decrement c10)
   changed: (value c10) from 74 to 67
   goals met: 10 of 13
155. (decrement c9)
   changed: (value c9) from 70 to 65
   goals met: 11 of 13
156. (decrement c7)
   changed: (value c7) from 93 to 91
   goals met: 12 of 13
157. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 12 of 13
158. (increment c9)
   changed: (value c9) from 65 to 71
   goals met: 11 of 13
159. (increment c9)
   changed: (value c9) from 71 to 77
   goals met: 11 of 13
160. (increment c10)
   changed: (value c10) from 67 to 74
   goals met: 10 of 13
161. (increment c11)
   changed: (value c11) from 68 to 73
   goals met: 9 of 13
162. (increment c12)
   changed: (value c12) from 69 to 79
   goals met: 9 of 13
163. (increment c13)
   changed: (value c13) from 70 to 75
   goals met: 9 of 13
164. (increment c13)
   changed: (value c13) from 75 to 80
   goals met: 10 of 13
165. (increment c11)
   changed: (value c11) from 73 to 78
   goals met: 11 of 13
166. (increment c10)
   changed: (value c10) from 74 to 81
   goals met: 11 of 13
167. (increment c11)
   changed: (value c11) from 78 to 83
   goals met: 11 of 13
168. (increment c12)
   changed: (value c12) from 79 to 89
   goals met: 11 of 13
169. (increment c13)
   changed: (value c13) from 80 to 85
   goals met: 11 of 13
170. (increment c13)
   changed: (value c13) from 85 to 90
   goals met: 12 of 13
171. (increment c9)
   changed: (value c9) from 77 to 83
   goals met: 11 of 13
172. (increment c10)
   changed: (value c10) from 81 to 88
   goals met: 11 of 13
173. (increment c11)
   changed: (value c11) from 83 to 88
   goals met: 11 of 13
174. (increment c11)
   changed: (value c11) from 88 to 93
   goals met: 11 of 13
175. (increment c12)
   changed: (value c12) from 89 to 99
   goals met: 11 of 13
176. (increment c13)
   changed: (value c13) from 90 to 95
   goals met: 11 of 13
177. (increment c13)
   changed: (value c13) from 95 to 100
   goals met: 12 of 13
178. (increment c9)
   changed: (value c9) from 83 to 89
   goals met: 11 of 13
179. (increment c10)
   changed: (value c10) from 88 to 95
   goals met: 11 of 13
180. (increment c11)
   changed: (value c11) from 93 to 98
   goals met: 12 of 13
181. (decrement c8)
   changed: (value c8) from 92 to 82
   goals met: 12 of 13
182. (decrement c7)
   changed: (value c7) from 91 to 89
   goals met: 12 of 13
183. (decrement c7)
   changed: (value c7) from 89 to 87
   goals met: 12 of 13
184. (decrement c7)
   changed: (value c7) from 87 to 85
   goals met: 12 of 13
185. (decrement c7)
   changed: (value c7) from 85 to 83
   goals met: 11 of 13
186. (decrement c7)
   changed: (value c7) from 83 to 81
   goals met: 12 of 13
187. (decrement c6)
   changed: (value c6) from 84 to 78
   goals met: 12 of 13
188. (decrement c5)
   changed: (value c5) from 83 to 81
   goals met: 11 of 13
189. (decrement c5)
   changed: (value c5) from 81 to 79
   goals met: 11 of 13
190. (decrement c5)
   changed: (value c5) from 79 to 77
   goals met: 12 of 13
191. (decrement c4)
   changed: (value c4) from 82 to 72
   goals met: 12 of 13
192. (decrement c3)
   changed: (value c3) from 78 to 73
   goals met: 12 of 13
193. (decrement c3)
   changed: (value c3) from 73 to 68
   goals met: 13 of 13
